ERP DEV.WMS/src/Catalogs/вмс_ИсточникиДанных/вмс_ИсточникиДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_ИсточникиДанных</name>
  <owners>Catalog.вмс_ПравилаЗаполненияЗадачиКладовщику</owners>
  <owners>Catalog.вмс_Операции</owners>
  <attributes>
    <name>Хранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
</mdclass:Catalog>

ERP DEV.WMS/src/Catalogs/вмс_ПравилаЗаполненияЗадачиКладовщику/вмс_ПравилаЗаполненияЗадачиКладовщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_ПравилаЗаполненияЗадачиКладовщику</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Активно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоНастройкаПолей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДанныеСКД</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданиеКладовщикуРаспоряжение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнятьПлан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаОтправитель</name>
    <type>
      <types>CatalogRef.вмс_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаПолучатель</name>
    <type>
      <types>CatalogRef.вмс_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЗонуОтбора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОСГНаОтбор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Контейнеры_ПеремещатьЦелыми</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Контейнеры_РазбиратьКонтейнеры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Контейнеры_СобиратьКонтейнеры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НестрогоеПланированиеЯчейкиОтбора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОперацияВозврат</name>
    <type>
      <types>CatalogRef.вмс_Операции</types>
    </type>
  </attributes>
  <attributes>
    <name>ОперацияНазначение</name>
    <type>
      <types>CatalogRef.вмс_Операции</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтбиратьПоПомещениям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтгружатьКонтейнерыБезПересчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЗонуОтправитель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтгружатьСоСлужебнойЗоныОтправителя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтгрузкаКонтейнеров_СначалаКонтейнеры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтгрузкаКонтейнеров_СначалаМонотоварныеКонтейнеры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтгрузкаКонтейнеров_СначалаЦелые</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодбиратьЯчейкиОтправители</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодбиратьЯчейкиПолучатели</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодбиратьЯчейкиПоСкладам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подпитка_ИспользоватьОСГНаОтбор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подпитка_ОбъединятьВОдноЗадание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подпитка_ПодбиратьЯчейкиПоПомещениям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подпитка_ПодбиратьЯчейкиПоСкладам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодтверждатьЗонуПолучатель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьДополнительныеЯчейкиПриемки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриниматьНаСлужебнуюЗонуПолучатель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмещатьКонтейнерыБезПересчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РаспоряжениеКонфигуратор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасширенныйРежимРедактирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимФормированияЗаданий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РучнойВводЗоныПолучателя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СледующееПравило</name>
    <type>
      <types>CatalogRef.вмс_ПравилаЗаполненияЗадачиКладовщику</types>
    </type>
  </attributes>
  <attributes>
    <name>СтрогоеПланированиеЯчейки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТестирование</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗоныОтправителя</name>
    <type>
      <types>EnumRef.вмс_ТипыЯчеек</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗоныПолучателя</name>
    <type>
      <types>EnumRef.вмс_ТипыЯчеек</types>
    </type>
  </attributes>
  <attributes>
    <name>Товары_ЗаполнятьПоОтобранным</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Товары_ЗаполнятьПоПринятым</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Товары_Переопределяемые</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Упаковка_ВводПоПлану</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УстанавливатьЯчейкуОтправитель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УстанавливатьЯчейкуПолучатель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСКДДокументы</name>
    <type>
      <types>CatalogRef.вмс_ИсточникиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСКДЗаданияКладовщику</name>
    <type>
      <types>CatalogRef.вмс_ИсточникиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСКДОснований</name>
    <type>
      <types>CatalogRef.вмс_ИсточникиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСКДТовары</name>
    <type>
      <types>CatalogRef.вмс_ИсточникиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСКДШапкиДокумента</name>
    <type>
      <types>CatalogRef.вмс_ИсточникиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеТестирование</name>
    <type>
      <types>CatalogRef.вмс_ИсточникиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСоответствиеРеквизитов</name>
    <type>
      <types>CatalogRef.вмс_ИсточникиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеДанныеСКД</name>
    <type>
      <types>CatalogRef.вмс_ИсточникиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>Шапка_Переопределяемая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтбиратьПросроченныеТовары</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараллельноеФормированиеЗаданийСледующегоЭтапа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Контейнеры_ПеремещатьЦелыми_НестрогоеПланирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Контейнеры_РазбиратьКонтейнеры_НестрогоеПланирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Контейнеры_СобиратьКонтейнеры_НестрогоеПланирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СохранятьПолныйКодМаркировки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьХранилищеСКДШапкиДокумента</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСоответствиеРеквизитов</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьХранилищеСКДТовары</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьХранилищеСКДОснований</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьХранилищеСКДЗаданияКладовщику</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьХранилищеСКДДокументы</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.вмс_ДополнительныеРеквизиты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.вмс_ДополнительныеРеквизиты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПредыдущиеОперации</name>
    <attributes>
      <name>ПредыдущаяОперация</name>
      <type>
        <types>CatalogRef.вмс_Операции</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТипыЯчеекОтправителей</name>
    <attributes>
      <name>ТипЯчейки</name>
      <type>
        <types>EnumRef.вмс_ТипыЯчеек</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТипыЯчеекПолучателей</name>
    <attributes>
      <name>ТипЯчейки</name>
      <type>
        <types>EnumRef.вмс_ТипыЯчеек</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP DEV.WMS/src/Catalogs/вмс_ИсточникиДанных/ManagerModule.bsl
Функция СохранитьИсточникДанных(Имя, Владелец, Данные) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	вмс_ИсточникиДанных.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.вмс_ИсточникиДанных КАК вмс_ИсточникиДанных
		|ГДЕ
		|	вмс_ИсточникиДанных.Наименование = &Наименование
		|	И вмс_ИсточникиДанных.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("Наименование", Имя);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ОбъектИсточник = Выборка.Ссылка.ПолучитьОбъект();
		ОбъектИсточник.Хранилище = Новый ХранилищеЗначения(Данные);
		ОбъектИсточник.Записать();
	Иначе
		ОбъектИсточник = СоздатьЭлемент();
		ОбъектИсточник.Владелец = Владелец;
		ОбъектИсточник.Наименование = Имя;
		ОбъектИсточник.Хранилище = Новый ХранилищеЗначения(Данные);
		ОбъектИсточник.ОбменДанными.Загрузка = Истина;
		ОбъектИсточник.Записать();
	КонецЕсли;
	
	Возврат ОбъектИсточник.Ссылка;
	
КонецФункции

Функция ИсточникДанных(Имя, Владелец) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	вмс_ИсточникиДанных.Хранилище КАК Хранилище
		|ИЗ
		|	Справочник.вмс_ИсточникиДанных КАК вмс_ИсточникиДанных
		|ГДЕ
		|	вмс_ИсточникиДанных.Наименование = &Наименование
		|	И вмс_ИсточникиДанных.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("Наименование", Имя);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Хранилище.Получить();
	Иначе
		Возврат Неопределено;
	КонецЕсли;
		
КонецФункции


Процедура ПереходНаВерсию325() Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	вмс_ПравилаЗаполненияЗадачиКладовщику.Ссылка КАК Правило,
		|	вмс_ПравилаЗаполненияЗадачиКладовщику.УдалитьХранилищеСКДДокументы КАК ХранилищеСКДДокументы,
		|	вмс_ПравилаЗаполненияЗадачиКладовщику.УдалитьХранилищеСКДЗаданияКладовщику КАК ХранилищеСКДЗаданияКладовщику,
		|	вмс_ПравилаЗаполненияЗадачиКладовщику.УдалитьХранилищеСКДОснований КАК ХранилищеСКДОснований,
		|	вмс_ПравилаЗаполненияЗадачиКладовщику.УдалитьХранилищеСКДТовары КАК ХранилищеСКДТовары,
		|	вмс_ПравилаЗаполненияЗадачиКладовщику.УдалитьХранилищеСКДШапкиДокумента КАК ХранилищеСКДШапкиДокумента,
		|	вмс_ПравилаЗаполненияЗадачиКладовщику.УдалитьТестирование КАК ХранилищеТестирование,
		|	вмс_ПравилаЗаполненияЗадачиКладовщику.УдалитьСоответствиеРеквизитов КАК ХранилищеСоответствиеРеквизитов,
		|	вмс_ПравилаЗаполненияЗадачиКладовщику.УдалитьДанныеСКД КАК ХранилищеДанныеСКД
		|ИЗ
		|	Справочник.вмс_ПравилаЗаполненияЗадачиКладовщику КАК вмс_ПравилаЗаполненияЗадачиКладовщику";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			СохранитьИсточникДанных("ХранилищеСКДДокументы", Выборка.Правило, Выборка.ХранилищеСКДДокументы.Получить());
			СохранитьИсточникДанных("ХранилищеСКДЗаданияКладовщику", Выборка.Правило, Выборка.ХранилищеСКДЗаданияКладовщику.Получить());
			СохранитьИсточникДанных("ХранилищеСКДОснований", Выборка.Правило, Выборка.ХранилищеСКДОснований.Получить());
			СохранитьИсточникДанных("ХранилищеСКДТовары", Выборка.Правило, Выборка.ХранилищеСКДТовары.Получить());
			СохранитьИсточникДанных("ХранилищеСКДШапкиДокумента", Выборка.Правило, Выборка.ХранилищеСКДШапкиДокумента.Получить());
			СохранитьИсточникДанных("ХранилищеТестирование", Выборка.Правило, Выборка.ХранилищеТестирование.Получить());
			СохранитьИсточникДанных("ХранилищеСоответствиеРеквизитов", Выборка.Правило, Выборка.ХранилищеСоответствиеРеквизитов.Получить());
			СохранитьИсточникДанных("ХранилищеДанныеСКД", Выборка.Правило, Выборка.ХранилищеДанныеСКД.Получить());
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	вмс_Операции.УдалитьХранилищеСхемыКомпоновкиДанных КАК ХранилищеСхемыКомпоновкиДанных,
		|	вмс_Операции.УдалитьКлассОперацииХранилище КАК КлассОперацииХранилище,
		|	вмс_Операции.УдалитьХранилищеСКДЗаданияКладовщику КАК ХранилищеСКДЗаданияКладовщику,
		|	вмс_Операции.УдалитьХранилищеСКДДокументы КАК ХранилищеСКДДокументы,
		|	вмс_Операции.УдалитьДанныеСКД КАК ДанныеСКД,
		|	вмс_Операции.Ссылка КАК Операция
		|ИЗ
		|	Справочник.вмс_Операции КАК вмс_Операции";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			СохранитьИсточникДанных("ХранилищеСхемыКомпоновкиДанных", Выборка.Операция, Выборка.ХранилищеСхемыКомпоновкиДанных.Получить());
			СохранитьИсточникДанных("КлассОперацииХранилище", Выборка.Операция, Выборка.КлассОперацииХранилище.Получить());
			СохранитьИсточникДанных("ХранилищеСКДЗаданияКладовщику", Выборка.Операция, Выборка.ХранилищеСКДЗаданияКладовщику.Получить());
			СохранитьИсточникДанных("ХранилищеСКДДокументы", Выборка.Операция, Выборка.ХранилищеСКДДокументы.Получить());
			СохранитьИсточникДанных("ДанныеСКД", Выборка.Операция, Выборка.ДанныеСКД.Получить());
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		вмс_Журналирование.Ошибка(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), "Начальное заполнение источников данных");
	КонецПопытки;
	
КонецПроцедуры
